###################################################################

# Created by write_sdc on Fri Apr 17 13:14:19 2026

###################################################################
set sdc_version 2.2

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_transition 0.5 [current_design]
set_max_fanout 8 [current_design]
create_clock [get_ports clk]  -period 4  -waveform {0 2}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  0.5  [get_ports reset]
set_input_delay -clock clk  0.5  [get_ports polarity]
set_input_delay -clock clk  0.5  [get_ports peri]
set_input_delay -clock clk  0.5  [get_ports peso]
set_input_delay -clock clk  0.5  [get_ports {pedo[63]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[62]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[61]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[60]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[59]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[58]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[57]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[56]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[55]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[54]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[53]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[52]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[51]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[50]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[49]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[48]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[47]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[46]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[45]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[44]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[43]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[42]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[41]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[40]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[39]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[38]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[37]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[36]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[35]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[34]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[33]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[32]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[31]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[30]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[29]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[28]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[27]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[26]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[25]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[24]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[23]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[22]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[21]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[20]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[19]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[18]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[17]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[16]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[15]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[14]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[13]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[12]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[11]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[10]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[9]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[8]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[7]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[6]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[5]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[4]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[3]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[2]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[1]}]
set_input_delay -clock clk  0.5  [get_ports {pedo[0]}]
set_output_delay -clock clk  0.5  [get_ports pesi]
set_output_delay -clock clk  0.5  [get_ports {pedi[63]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[62]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[61]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[60]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[59]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[58]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[57]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[56]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[55]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[54]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[53]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[52]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[51]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[50]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[49]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[48]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[47]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[46]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[45]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[44]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[43]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[42]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[41]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[40]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[39]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[38]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[37]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[36]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[35]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[34]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[33]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[32]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[31]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[30]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[29]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[28]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[27]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[26]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[25]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[24]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[23]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[22]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[21]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[20]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[19]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[18]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[17]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[16]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[15]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[14]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[13]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[12]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[11]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[10]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[9]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[8]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[7]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[6]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[5]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[4]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[3]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[2]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[1]}]
set_output_delay -clock clk  0.5  [get_ports {pedi[0]}]
set_output_delay -clock clk  0.5  [get_ports pero]
set_multicycle_path 40 -setup -from [get_cells u_cpu/idex_*]
set_multicycle_path 39 -hold  -from [get_cells u_cpu/idex_*]
