###################################################################

# Created by write_sdc on Wed Mar 11 12:46:11 2026

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_area 0
create_clock [get_ports clk]  -period 4  -waveform {0 2}
set_input_delay -clock clk  0.8  [get_ports clk]
set_input_delay -clock clk  0.8  [get_ports reset]
set_input_delay -clock clk  0.8  [get_ports nsi]
set_input_delay -clock clk  0.8  [get_ports {ndi[63]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[62]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[61]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[60]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[59]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[58]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[57]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[56]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[55]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[54]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[53]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[52]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[51]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[50]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[49]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[48]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[47]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[46]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[45]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[44]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[43]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[42]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[41]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[40]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[39]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[38]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[37]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[36]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[35]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[34]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[33]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[32]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[31]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[30]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[29]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[28]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[27]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[26]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[25]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[24]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[23]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[22]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[21]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[20]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[19]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[18]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[17]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[16]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[15]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[14]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[13]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[12]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[11]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[10]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[9]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[8]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[7]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[6]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[5]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[4]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[3]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[2]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[1]}]
set_input_delay -clock clk  0.8  [get_ports {ndi[0]}]
set_input_delay -clock clk  0.8  [get_ports nro]
set_input_delay -clock clk  0.8  [get_ports ssi]
set_input_delay -clock clk  0.8  [get_ports {sdi[63]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[62]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[61]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[60]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[59]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[58]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[57]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[56]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[55]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[54]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[53]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[52]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[51]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[50]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[49]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[48]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[47]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[46]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[45]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[44]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[43]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[42]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[41]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[40]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[39]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[38]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[37]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[36]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[35]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[34]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[33]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[32]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[31]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[30]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[29]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[28]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[27]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[26]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[25]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[24]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[23]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[22]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[21]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[20]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[19]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[18]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[17]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[16]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[15]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[14]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[13]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[12]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[11]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[10]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[9]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[8]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[7]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[6]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[5]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[4]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[3]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[2]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[1]}]
set_input_delay -clock clk  0.8  [get_ports {sdi[0]}]
set_input_delay -clock clk  0.8  [get_ports sro]
set_input_delay -clock clk  0.8  [get_ports esi]
set_input_delay -clock clk  0.8  [get_ports {edi[63]}]
set_input_delay -clock clk  0.8  [get_ports {edi[62]}]
set_input_delay -clock clk  0.8  [get_ports {edi[61]}]
set_input_delay -clock clk  0.8  [get_ports {edi[60]}]
set_input_delay -clock clk  0.8  [get_ports {edi[59]}]
set_input_delay -clock clk  0.8  [get_ports {edi[58]}]
set_input_delay -clock clk  0.8  [get_ports {edi[57]}]
set_input_delay -clock clk  0.8  [get_ports {edi[56]}]
set_input_delay -clock clk  0.8  [get_ports {edi[55]}]
set_input_delay -clock clk  0.8  [get_ports {edi[54]}]
set_input_delay -clock clk  0.8  [get_ports {edi[53]}]
set_input_delay -clock clk  0.8  [get_ports {edi[52]}]
set_input_delay -clock clk  0.8  [get_ports {edi[51]}]
set_input_delay -clock clk  0.8  [get_ports {edi[50]}]
set_input_delay -clock clk  0.8  [get_ports {edi[49]}]
set_input_delay -clock clk  0.8  [get_ports {edi[48]}]
set_input_delay -clock clk  0.8  [get_ports {edi[47]}]
set_input_delay -clock clk  0.8  [get_ports {edi[46]}]
set_input_delay -clock clk  0.8  [get_ports {edi[45]}]
set_input_delay -clock clk  0.8  [get_ports {edi[44]}]
set_input_delay -clock clk  0.8  [get_ports {edi[43]}]
set_input_delay -clock clk  0.8  [get_ports {edi[42]}]
set_input_delay -clock clk  0.8  [get_ports {edi[41]}]
set_input_delay -clock clk  0.8  [get_ports {edi[40]}]
set_input_delay -clock clk  0.8  [get_ports {edi[39]}]
set_input_delay -clock clk  0.8  [get_ports {edi[38]}]
set_input_delay -clock clk  0.8  [get_ports {edi[37]}]
set_input_delay -clock clk  0.8  [get_ports {edi[36]}]
set_input_delay -clock clk  0.8  [get_ports {edi[35]}]
set_input_delay -clock clk  0.8  [get_ports {edi[34]}]
set_input_delay -clock clk  0.8  [get_ports {edi[33]}]
set_input_delay -clock clk  0.8  [get_ports {edi[32]}]
set_input_delay -clock clk  0.8  [get_ports {edi[31]}]
set_input_delay -clock clk  0.8  [get_ports {edi[30]}]
set_input_delay -clock clk  0.8  [get_ports {edi[29]}]
set_input_delay -clock clk  0.8  [get_ports {edi[28]}]
set_input_delay -clock clk  0.8  [get_ports {edi[27]}]
set_input_delay -clock clk  0.8  [get_ports {edi[26]}]
set_input_delay -clock clk  0.8  [get_ports {edi[25]}]
set_input_delay -clock clk  0.8  [get_ports {edi[24]}]
set_input_delay -clock clk  0.8  [get_ports {edi[23]}]
set_input_delay -clock clk  0.8  [get_ports {edi[22]}]
set_input_delay -clock clk  0.8  [get_ports {edi[21]}]
set_input_delay -clock clk  0.8  [get_ports {edi[20]}]
set_input_delay -clock clk  0.8  [get_ports {edi[19]}]
set_input_delay -clock clk  0.8  [get_ports {edi[18]}]
set_input_delay -clock clk  0.8  [get_ports {edi[17]}]
set_input_delay -clock clk  0.8  [get_ports {edi[16]}]
set_input_delay -clock clk  0.8  [get_ports {edi[15]}]
set_input_delay -clock clk  0.8  [get_ports {edi[14]}]
set_input_delay -clock clk  0.8  [get_ports {edi[13]}]
set_input_delay -clock clk  0.8  [get_ports {edi[12]}]
set_input_delay -clock clk  0.8  [get_ports {edi[11]}]
set_input_delay -clock clk  0.8  [get_ports {edi[10]}]
set_input_delay -clock clk  0.8  [get_ports {edi[9]}]
set_input_delay -clock clk  0.8  [get_ports {edi[8]}]
set_input_delay -clock clk  0.8  [get_ports {edi[7]}]
set_input_delay -clock clk  0.8  [get_ports {edi[6]}]
set_input_delay -clock clk  0.8  [get_ports {edi[5]}]
set_input_delay -clock clk  0.8  [get_ports {edi[4]}]
set_input_delay -clock clk  0.8  [get_ports {edi[3]}]
set_input_delay -clock clk  0.8  [get_ports {edi[2]}]
set_input_delay -clock clk  0.8  [get_ports {edi[1]}]
set_input_delay -clock clk  0.8  [get_ports {edi[0]}]
set_input_delay -clock clk  0.8  [get_ports ero]
set_input_delay -clock clk  0.8  [get_ports wsi]
set_input_delay -clock clk  0.8  [get_ports {wdi[63]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[62]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[61]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[60]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[59]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[58]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[57]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[56]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[55]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[54]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[53]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[52]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[51]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[50]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[49]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[48]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[47]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[46]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[45]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[44]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[43]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[42]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[41]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[40]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[39]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[38]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[37]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[36]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[35]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[34]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[33]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[32]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[31]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[30]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[29]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[28]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[27]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[26]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[25]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[24]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[23]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[22]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[21]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[20]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[19]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[18]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[17]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[16]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[15]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[14]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[13]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[12]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[11]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[10]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[9]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[8]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[7]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[6]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[5]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[4]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[3]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[2]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[1]}]
set_input_delay -clock clk  0.8  [get_ports {wdi[0]}]
set_input_delay -clock clk  0.8  [get_ports wro]
set_input_delay -clock clk  0.8  [get_ports pesi]
set_input_delay -clock clk  0.8  [get_ports {pedi[63]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[62]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[61]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[60]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[59]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[58]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[57]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[56]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[55]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[54]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[53]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[52]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[51]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[50]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[49]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[48]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[47]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[46]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[45]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[44]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[43]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[42]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[41]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[40]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[39]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[38]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[37]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[36]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[35]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[34]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[33]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[32]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[31]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[30]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[29]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[28]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[27]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[26]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[25]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[24]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[23]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[22]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[21]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[20]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[19]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[18]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[17]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[16]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[15]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[14]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[13]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[12]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[11]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[10]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[9]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[8]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[7]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[6]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[5]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[4]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[3]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[2]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[1]}]
set_input_delay -clock clk  0.8  [get_ports {pedi[0]}]
set_input_delay -clock clk  0.8  [get_ports pero]
set_output_delay -clock clk  0.8  [get_ports polarity]
set_output_delay -clock clk  0.8  [get_ports nri]
set_output_delay -clock clk  0.8  [get_ports nso]
set_output_delay -clock clk  0.8  [get_ports {ndo[63]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[62]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[61]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[60]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[59]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[58]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[57]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[56]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[55]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[54]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[53]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[52]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[51]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[50]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[49]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[48]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[47]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[46]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[45]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[44]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[43]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[42]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[41]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[40]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[39]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[38]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[37]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[36]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[35]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[34]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[33]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[32]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[31]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[30]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[29]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[28]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[27]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[26]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[25]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[24]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[23]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[22]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[21]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[20]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[19]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[18]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[17]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[16]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[15]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[14]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[13]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[12]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[11]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[10]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[9]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[8]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[7]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[6]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[5]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[4]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[3]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[2]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[1]}]
set_output_delay -clock clk  0.8  [get_ports {ndo[0]}]
set_output_delay -clock clk  0.8  [get_ports sri]
set_output_delay -clock clk  0.8  [get_ports sso]
set_output_delay -clock clk  0.8  [get_ports {sdo[63]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[62]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[61]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[60]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[59]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[58]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[57]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[56]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[55]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[54]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[53]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[52]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[51]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[50]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[49]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[48]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[47]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[46]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[45]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[44]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[43]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[42]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[41]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[40]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[39]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[38]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[37]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[36]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[35]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[34]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[33]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[32]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[31]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[30]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[29]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[28]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[27]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[26]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[25]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[24]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[23]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[22]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[21]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[20]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[19]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[18]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[17]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[16]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[15]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[14]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[13]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[12]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[11]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[10]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[9]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[8]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[7]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[6]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[5]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[4]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[3]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[2]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[1]}]
set_output_delay -clock clk  0.8  [get_ports {sdo[0]}]
set_output_delay -clock clk  0.8  [get_ports eri]
set_output_delay -clock clk  0.8  [get_ports eso]
set_output_delay -clock clk  0.8  [get_ports {edo[63]}]
set_output_delay -clock clk  0.8  [get_ports {edo[62]}]
set_output_delay -clock clk  0.8  [get_ports {edo[61]}]
set_output_delay -clock clk  0.8  [get_ports {edo[60]}]
set_output_delay -clock clk  0.8  [get_ports {edo[59]}]
set_output_delay -clock clk  0.8  [get_ports {edo[58]}]
set_output_delay -clock clk  0.8  [get_ports {edo[57]}]
set_output_delay -clock clk  0.8  [get_ports {edo[56]}]
set_output_delay -clock clk  0.8  [get_ports {edo[55]}]
set_output_delay -clock clk  0.8  [get_ports {edo[54]}]
set_output_delay -clock clk  0.8  [get_ports {edo[53]}]
set_output_delay -clock clk  0.8  [get_ports {edo[52]}]
set_output_delay -clock clk  0.8  [get_ports {edo[51]}]
set_output_delay -clock clk  0.8  [get_ports {edo[50]}]
set_output_delay -clock clk  0.8  [get_ports {edo[49]}]
set_output_delay -clock clk  0.8  [get_ports {edo[48]}]
set_output_delay -clock clk  0.8  [get_ports {edo[47]}]
set_output_delay -clock clk  0.8  [get_ports {edo[46]}]
set_output_delay -clock clk  0.8  [get_ports {edo[45]}]
set_output_delay -clock clk  0.8  [get_ports {edo[44]}]
set_output_delay -clock clk  0.8  [get_ports {edo[43]}]
set_output_delay -clock clk  0.8  [get_ports {edo[42]}]
set_output_delay -clock clk  0.8  [get_ports {edo[41]}]
set_output_delay -clock clk  0.8  [get_ports {edo[40]}]
set_output_delay -clock clk  0.8  [get_ports {edo[39]}]
set_output_delay -clock clk  0.8  [get_ports {edo[38]}]
set_output_delay -clock clk  0.8  [get_ports {edo[37]}]
set_output_delay -clock clk  0.8  [get_ports {edo[36]}]
set_output_delay -clock clk  0.8  [get_ports {edo[35]}]
set_output_delay -clock clk  0.8  [get_ports {edo[34]}]
set_output_delay -clock clk  0.8  [get_ports {edo[33]}]
set_output_delay -clock clk  0.8  [get_ports {edo[32]}]
set_output_delay -clock clk  0.8  [get_ports {edo[31]}]
set_output_delay -clock clk  0.8  [get_ports {edo[30]}]
set_output_delay -clock clk  0.8  [get_ports {edo[29]}]
set_output_delay -clock clk  0.8  [get_ports {edo[28]}]
set_output_delay -clock clk  0.8  [get_ports {edo[27]}]
set_output_delay -clock clk  0.8  [get_ports {edo[26]}]
set_output_delay -clock clk  0.8  [get_ports {edo[25]}]
set_output_delay -clock clk  0.8  [get_ports {edo[24]}]
set_output_delay -clock clk  0.8  [get_ports {edo[23]}]
set_output_delay -clock clk  0.8  [get_ports {edo[22]}]
set_output_delay -clock clk  0.8  [get_ports {edo[21]}]
set_output_delay -clock clk  0.8  [get_ports {edo[20]}]
set_output_delay -clock clk  0.8  [get_ports {edo[19]}]
set_output_delay -clock clk  0.8  [get_ports {edo[18]}]
set_output_delay -clock clk  0.8  [get_ports {edo[17]}]
set_output_delay -clock clk  0.8  [get_ports {edo[16]}]
set_output_delay -clock clk  0.8  [get_ports {edo[15]}]
set_output_delay -clock clk  0.8  [get_ports {edo[14]}]
set_output_delay -clock clk  0.8  [get_ports {edo[13]}]
set_output_delay -clock clk  0.8  [get_ports {edo[12]}]
set_output_delay -clock clk  0.8  [get_ports {edo[11]}]
set_output_delay -clock clk  0.8  [get_ports {edo[10]}]
set_output_delay -clock clk  0.8  [get_ports {edo[9]}]
set_output_delay -clock clk  0.8  [get_ports {edo[8]}]
set_output_delay -clock clk  0.8  [get_ports {edo[7]}]
set_output_delay -clock clk  0.8  [get_ports {edo[6]}]
set_output_delay -clock clk  0.8  [get_ports {edo[5]}]
set_output_delay -clock clk  0.8  [get_ports {edo[4]}]
set_output_delay -clock clk  0.8  [get_ports {edo[3]}]
set_output_delay -clock clk  0.8  [get_ports {edo[2]}]
set_output_delay -clock clk  0.8  [get_ports {edo[1]}]
set_output_delay -clock clk  0.8  [get_ports {edo[0]}]
set_output_delay -clock clk  0.8  [get_ports wri]
set_output_delay -clock clk  0.8  [get_ports wso]
set_output_delay -clock clk  0.8  [get_ports {wdo[63]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[62]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[61]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[60]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[59]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[58]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[57]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[56]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[55]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[54]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[53]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[52]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[51]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[50]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[49]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[48]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[47]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[46]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[45]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[44]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[43]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[42]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[41]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[40]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[39]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[38]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[37]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[36]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[35]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[34]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[33]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[32]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[31]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[30]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[29]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[28]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[27]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[26]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[25]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[24]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[23]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[22]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[21]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[20]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[19]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[18]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[17]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[16]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[15]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[14]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[13]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[12]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[11]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[10]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[9]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[8]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[7]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[6]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[5]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[4]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[3]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[2]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[1]}]
set_output_delay -clock clk  0.8  [get_ports {wdo[0]}]
set_output_delay -clock clk  0.8  [get_ports peri]
set_output_delay -clock clk  0.8  [get_ports peso]
set_output_delay -clock clk  0.8  [get_ports {pedo[63]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[62]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[61]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[60]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[59]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[58]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[57]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[56]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[55]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[54]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[53]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[52]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[51]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[50]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[49]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[48]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[47]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[46]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[45]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[44]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[43]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[42]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[41]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[40]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[39]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[38]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[37]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[36]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[35]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[34]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[33]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[32]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[31]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[30]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[29]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[28]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[27]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[26]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[25]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[24]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[23]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[22]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[21]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[20]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[19]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[18]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[17]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[16]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[15]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[14]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[13]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[12]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[11]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[10]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[9]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[8]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[7]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[6]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[5]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[4]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[3]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[2]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[1]}]
set_output_delay -clock clk  0.8  [get_ports {pedo[0]}]
